backend/tests/perftest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
    - duration: 30
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/login"
          json:
            username: "admin@gmail.com"
            password: "admin"
          capture:
            json: "$.token"
            as: "token"
      - get:
          url: "/details"
          headers:
            Authorization: "Bearer {{token}}"